KunYi/nRF5_SDK_Thread/examples/multiprotocol/ble_zigbee/ble_zigbee_dynamic_door_lock_nus/main.c
/**
 * Copyright (c) 2018 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
/** @file
 *
 * @defgroup zigbee_examples_multiprotocol_nus_door_lock main.c
 * @{
 * @ingroup  zigbee_examples
 * @brief    UART over BLE application with Zigbee HA Door Lock profile.
 *
 * This file contains the source code for a sample application that uses the Nordic UART service
 * and a door lock operating a Zigbee network.
 * This application uses the @ref srvlib_conn_params module.
 */
#include "zboss_api.h"
#include "zb_mem_config_min.h"
#include "zb_error_handler.h"
#include "zb_zcl_identify.h"
#include "zigbee_cli_utils.h"
#include "zigbee_helpers.h"

#include "nus.h"

#include "app_timer.h"
#include "app_pwm.h"
#include "boards.h"
#include "bsp_btn_ble.h"
#include "fds.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#define APP_BLE_OBSERVER_PRIO               1                                       /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define IEEE_CHANNEL_MASK                   (1l << ZIGBEE_CHANNEL)                  /**< Scan only one, predefined channel to find the coordinator. */
#define DOOR_LOCK_ENDPOINT                  8                                       /**< First source endpoint used to control Door Lock. */
#define ERASE_PERSISTENT_CONFIG             ZB_FALSE                                /**< Do not erase NVRAM to save the network parameters after device reboot or power-off. NOTE: If this option is set to ZB_TRUE then do full device erase for all network devices before running other samples. */
#define ZIGBEE_NETWORK_STATE_LED            BSP_BOARD_LED_2                         /**< LED indicating that Door Lock successfully joind Zigbee network. */
#define DOOR_LOCK_STATE_LED                 BSP_BOARD_LED_3                         /**< LED indicating that the state of the door (closed - ON, open - OFF). */
#define DOOR_LOCK_CONFIG_FILE               0xBEEF                                  /**< ID of the file with the Door Lock configuration. */
#define DOOR_LOCK_CONFIG_STATE_KEY          0x1337                                  /**< ID of the key with Door Lock state inside the configuration. */

#define DOOR_LOCK_BASIC_APP_VERSION         01                                      /**< Version of the application software (1 byte). */
#define DOOR_LOCK_BASIC_STACK_VERSION       10                                      /**< Version of the implementation of the ZigBee stack (1 byte). */
#define DOOR_LOCK_BASIC_HW_VERSION          11                                      /**< Version of the hardware of the device (1 byte). */
#define DOOR_LOCK_BASIC_MANUF_NAME          "Nordic"                                /**< Manufacturer name (32 bytes). */
#define DOOR_LOCK_BASIC_MODEL_ID            "Door_Lock_v0.1"                        /**< Model number assigned by manufacturer (32-bytes long string). */
#define DOOR_LOCK_BASIC_DATE_CODE           "20180113"                              /**< First 8 bytes specify the date of manufacturer of the device in ISO 8601 format (YYYYMMDD). Th rest (8 bytes) are manufacturer specific. */
#define DOOR_LOCK_BASIC_POWER_SOURCE        ZB_ZCL_BASIC_POWER_SOURCE_DC_SOURCE     /**< Type of power sources available for the device. For possible values see section 3.2.2.2.8 of ZCL specification. */
#define DOOR_LOCK_BASIC_PH_ENV              ZB_ZCL_BASIC_ENV_UNSPECIFIED            /**< Describes the type of physical environment. For possible values see section 3.2.2.2.10 of ZCL specification. */
#define DOOR_LOCK_BASIC_LOCATION_DESC       "Cave"                                  /**< Describes the physical location of the device (16 bytes). May be modified during commisioning process. */

#define NUS_COMMAND_OPEN                    "sesame"                                /**< NUS command that will unlock the door. */
#define NUS_COMMAND_CLOSE                   "hodor"                                 /**< NUS command that will lock the door. */

#define LOCK_MECHANISM_PIN                  NRF_GPIO_PIN_MAP(0,29)                  /**< Pin 0.29 - the one which drives the PWM. */
#define LOCK_MECHANISM_PWM_NAME             PWM1                                    /**< PWM instance used to drive the door lock. */
#define LOCK_MECHANISM_PWM_TIMER            2                                       /**< Timer number used by PWM. */
#define LOCK_MECHANISM_STATE_OPEN_DC        70                                      /**< Duty Cycle to maintain at the Lock Open state. */
#define LOCK_MECHANISM_STATE_CLOSE_DC       55                                      /**< Duty Cycle to maintain at the Lock Close state. */

