KunYi/nRF5_SDK_Thread/examples/multiprotocol/ble_zigbee/ble_zigbee_dynamic_door_lock_nus/main.c
#if !defined ZB_ED_ROLE
#error Define ZB_ED_ROLE to compile Door Lock (End Device) source code.
#endif

APP_PWM_INSTANCE(LOCK_MECHANISM_PWM_NAME, LOCK_MECHANISM_PWM_TIMER);                /**< PWM Instance to steer the lock. */
static volatile bool m_fds_initialized;                                             /**< Flag which signals the FDS subsystem being initialised. */
static volatile bool m_garbage_flag;                                                /**< Flag which signals the need for garbage collector to clean up the flash. */

/* Basic cluster attributes. */
typedef struct
{
    zb_uint8_t zcl_version;
    zb_uint8_t app_version;
    zb_uint8_t stack_version;
    zb_uint8_t hw_version;
    zb_char_t  mf_name[32];
    zb_char_t  model_id[32];
    zb_char_t  date_code[16];
    zb_uint8_t power_source;
    zb_char_t  location_id[17];
    zb_uint8_t ph_env;
    zb_char_t  sw_ver[17];
} door_lock_basic_attr_t;

/* Identify cluster attributes. */
typedef struct
{
    zb_uint16_t identify_time;
} door_lock_identify_attr_t;

/* Scenes cluster attributes. */
typedef struct
{
    zb_uint8_t  scene_count;
    zb_uint8_t  current_scene;
    zb_uint8_t  scene_valid;
    zb_uint8_t  name_support;
    zb_uint16_t current_group;
} door_lock_scenes_attr_t;

/* Groups cluster attributes. */
typedef struct
{
    zb_uint8_t name_support;
} door_lock_groups_attr_t;

/* Door Lock cluster attributes. */
typedef struct
{
    zb_uint8_t lock_state;
    zb_uint8_t lock_type;
    zb_bool_t  actuator_enabled;
} door_lock_door_lock_attr_t;

/* Protocol-agnostic configuration of Door Lock. */
typedef struct
{
    uint32_t is_locked;
} door_lock_configuration_t;

/* Main application customizable context. Stores all settings and static values. */
typedef struct door_lock_ctx_s
{
    door_lock_configuration_t      configuration;  // Configuration has to be word-aligned, because of FDS, hence it's first in the structure.
    door_lock_basic_attr_t         basic_attr;
    door_lock_identify_attr_t      identify_attr;
    door_lock_scenes_attr_t        scenes_attr;
    door_lock_groups_attr_t        groups_attr;
    door_lock_door_lock_attr_t     door_lock_attr;
} door_lock_ctx_t;

static door_lock_ctx_t m_dev_ctx;

/* Configuration record for the FDS subsystem. */
static fds_record_t const m_configuration_record =
{
    .file_id           = DOOR_LOCK_CONFIG_FILE,
    .key               = DOOR_LOCK_CONFIG_STATE_KEY,
    .data.p_data       = &m_dev_ctx.configuration,
    /* The length of a record is always expressed in 4-byte units (words). */
    .data.length_words = (sizeof(m_dev_ctx.configuration) + 3) / sizeof(uint32_t),
};

ZB_ZCL_DECLARE_BASIC_ATTRIB_LIST_EXT(basic_attr_list,
                                     &m_dev_ctx.basic_attr.zcl_version,
                                     &m_dev_ctx.basic_attr.app_version,
                                     &m_dev_ctx.basic_attr.stack_version,
                                     &m_dev_ctx.basic_attr.hw_version,
                                     m_dev_ctx.basic_attr.mf_name,
                                     m_dev_ctx.basic_attr.model_id,
                                     m_dev_ctx.basic_attr.date_code,
                                     &m_dev_ctx.basic_attr.power_source,
                                     m_dev_ctx.basic_attr.location_id,
                                     &m_dev_ctx.basic_attr.ph_env,
                                     m_dev_ctx.basic_attr.sw_ver);

ZB_ZCL_DECLARE_IDENTIFY_ATTRIB_LIST(identify_attr_list, &m_dev_ctx.identify_attr.identify_time);

ZB_ZCL_DECLARE_GROUPS_ATTRIB_LIST(groups_attr_list, &m_dev_ctx.groups_attr.name_support);

ZB_ZCL_DECLARE_SCENES_ATTRIB_LIST(scenes_attr_list,
                                  &m_dev_ctx.scenes_attr.scene_count,
                                  &m_dev_ctx.scenes_attr.current_scene,
                                  &m_dev_ctx.scenes_attr.current_group,
                                  &m_dev_ctx.scenes_attr.scene_valid,
                                  &m_dev_ctx.scenes_attr.name_support);

ZB_ZCL_DECLARE_DOOR_LOCK_ATTRIB_LIST(door_lock_attr_list,
                                     &m_dev_ctx.door_lock_attr.lock_state,
                                     &m_dev_ctx.door_lock_attr.lock_type,
                                     &m_dev_ctx.door_lock_attr.actuator_enabled);

ZB_HA_DECLARE_DOOR_LOCK_CLUSTER_LIST(door_lock_clusters, 
                                     door_lock_attr_list, 
                                     basic_attr_list, 
                                     identify_attr_list, 
                                     groups_attr_list, 
                                     scenes_attr_list);

ZB_HA_DECLARE_DOOR_LOCK_EP(door_lock_ep, DOOR_LOCK_ENDPOINT, door_lock_clusters);

ZB_HA_DECLARE_DOOR_LOCK_CTX(door_lock_ctx, door_lock_ep);


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    uint32_t err_code;

    UNUSED_PARAMETER(p_context);

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected");
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected");
            bsp_board_led_off(BSP_BOARD_LED_0);
            bsp_board_led_off(BSP_BOARD_LED_1);
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            break;
    }
}


/***************************************************************************************************
 * @section Initialization
 **************************************************************************************************/

